FahrJo/STM32F4_Transportkontrollsystem/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2019 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"
#include "fatfs.h"

/* USER CODE BEGIN Includes */
#include "card_operations.h"
#include "acceleration_Sensor.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

I2C_HandleTypeDef hi2c3;

SD_HandleTypeDef hsd;

SPI_HandleTypeDef hspi1;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

// Flags f�r die Aktivierung von Softwarefunktionen
char SDIO_ENABLE 					=	1;
char ACCELERATION_ENABLE 	=	1;
char GNSS_ENABLE 					=	1;
char LIGHT_ENABLE 				=	1;
char TEMP_ENABLE 					=	1;
char ACC_MAX_ANZAHL_WERTE =	20;

// Initialisierungswert f�r das Sammeln eines kompletten Datensatzes
char GET_DATA;

int MAX_TEMP							= 333;		// Temperatur in K, �BER der ein Interrupt ausgel�st wird
int MIN_TEMP							= 263;		// Temperatur in K, UNTER der ein Interrupt ausgel�st wird

int MAX_TEMP_RAW;
int MIN_TEMP_RAW;


const uint16_t 	datasetCount = 20;				// Anzahl der Datens�tze, die gesammelt auf die Karte geschrieben werden
uint16_t				actualSet = 0;						// Momentan aktiver Datensatz
ADC_AnalogWDGConfTypeDef AnalogWDGConf;

struct tm				clock_time;

FATFS 					myFatFS;
FIL 						logFile;									// Dateihandle auf SD-Karte
FIL 						configFile;								// Dateihandle auf SD-Karte
UINT 						cursor;										// Letztes Zeichen in CSV-Datei
UINT 						configCursor;							// Letztes Zeichen in CSV-Datei
char 						logFileName[] = "Log3.csv";
char 						configFileName[] = "config.txt";
char 						configBuffer[128];
char 						header[] = "Tracking-Log vom 17.01.2019;;;;;;\n Date/Time;Location;Acceleration X; Acceleration Y; Acceleration Z;Temp;Open;Note\n";
uint32_t 				Temp_Raw;									// Temperatur in 12 Bit aus ADC
uint16_t 				Temp;											// Temperatur in �C
dataset 				sensor_set[datasetCount];	// Datensatz, der im RAM gepuffert wird
workmode_type 	operation_mode = workmode_log;			// Betriebsmodus (Energiespar-Funktion)
event_type 			event;										// Event f�r die Detektierung einer Grenzwert�berschreitung

s_accelerometerValues 			acceleration_actual_global;
s_accelerometerValuesFloat 	acceleration_actual_float;


/* Trigger-Flags f�r das Einlesen von Daten */
char 						getDataset;
char 						getTemp;
char 						getLight;
char 						getAcceleration;
char 						getPosition;
char						writeDataset;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_ADC1_Init(void);
static void MX_I2C3_Init(void);
static void MX_SDIO_SD_Init(void);
static void MX_SPI1_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
void Timer4_Init(void);
void AnalogWDG_Init(void);
void setPreferences(char* buff, UINT buffLength);

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
	s_accelerometerValues acceleration_actual;
	s_accelerometerValues acceleration_ringbuffer[ACC_MAX_ANZAHL_WERTE];
	HAL_StatusTypeDef i2c_status = HAL_BUSY;
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

