FahrJo/STM32F4_Transportkontrollsystem/Src/main.c
  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_ADC1_Init();
  MX_I2C3_Init();
  MX_FATFS_Init();
  MX_SDIO_SD_Init();
  MX_SPI1_Init();
  /* USER CODE BEGIN 2 */
	
	if(ACCELERATION_ENABLE){
		// Acc-Sensor �ber I2C deaktivieren und dann wieder aktivieren, damit dieser sicher aktiviert wird
		HAL_Delay(5000);
		ACC_deactivate(&hi2c3);
		HAL_Delay(500);
		ACC_activate(&hi2c3);
		HAL_Delay(500);
	}
	
/*	if(GNSS_ENABLE) {
		GNSS_ENABLE = 0; // erst mal deaktiveren, wenn GPS aktivierung erfolgreich wird es wieder ENABLED
		// wenn nach 4 Versuchen, das Modul nicht aktivert werden kann, bleibt GNSS_ENABLE=0 und das Programm lauft "normal" weiter
		for(int i=0;i<4;i++){
			
			if(-1 != GPS_activateReceiver()){ //GPS erfolgreich aktiviert, for-Schleife verlassen
				GNSS_ENABLE=1;
				i=5; 
			}
			HAL_Delay(100);
		}
	}
*/
	
	/* Vorbereiten der SD-Karte ------------------------------------------------*/
	if(SDIO_ENABLE){
		if(f_mount(&myFatFS, SDPath, 1) == FR_OK){
			if(f_open(&configFile, configFileName, FA_READ | FA_OPEN_EXISTING) == FR_OK){
				f_read(&configFile, configBuffer, sizeof(configBuffer), &configCursor);
				setPreferences(configBuffer, sizeof(configBuffer));
			}
			write_string_to_file(&logFile, logFileName, header,	sizeof(header), &cursor);
		}
		else{
			HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_SET);
		}
	}
	// Remove following line if config file works...
	setPreferences(configBuffer, sizeof(configBuffer));	
	Timer4_Init();
	AnalogWDG_Init();
	
	GET_DATA = ACCELERATION_ENABLE + GNSS_ENABLE + LIGHT_ENABLE + TEMP_ENABLE;
	
	/* Starte ADC --------------------------------------------------------------*/
	if(TEMP_ENABLE){
		HAL_ADC_Start_DMA(&hadc1, &Temp_Raw, 1);
		HAL_ADC_Start_IT(&hadc1);
	}

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
		
		if(getLight | getTemp | getAcceleration | getPosition | getDataset){
		
			/* Einlesen der Fotodiode und Ablage in den Datensatz ------------------*/
			if(LIGHT_ENABLE){
				if(getLight | getDataset){
					getLight = 0;
					getDataset--;
					
					if(HAL_GPIO_ReadPin(INT_Photodiode_GPIO_Port, INT_Photodiode_Pin) == 1){
						HAL_GPIO_WritePin(LED6_GPIO_Port, LED6_Pin, GPIO_PIN_SET);
						sensor_set[actualSet].open = 1;
					}
					else{
						HAL_GPIO_WritePin(LED6_GPIO_Port, LED6_Pin, GPIO_PIN_RESET);
						sensor_set[actualSet].open = 0;
					}
				}
			}
			
			/* Einlesen der Temperatur und Ablage in den Datensatz -----------------*/
			if(TEMP_ENABLE){
				HAL_ADC_Start_IT(&hadc1);
				
				if(getTemp | getDataset){
					getTemp = 0;
					getDataset--;
					
					sensor_set[actualSet].temperature = 300 * 2 * Temp_Raw / 4096 - 273;		/* Umrechnung der 12-Bit Rohdaten in �C */
					Temp = sensor_set[actualSet].temperature;
				}
			}
			
			/* Einlesen der Beschleunigungsdaten und Ablage in den Datensatz -------*/
			if(ACCELERATION_ENABLE){
				
				if(getAcceleration | getDataset){
					getAcceleration = 0;
					getDataset--;
					
					i2c_status = ACC_getAllValues(&hi2c3, &acceleration_actual);
					if(i2c_status == HAL_OK){
//						acceleration_actual_float.x_Value = ACC_convertAccelToFloat(acceleration_actual.x_Value, 12, 2);
//						acceleration_actual_float.y_Value = ACC_convertAccelToFloat(acceleration_actual.y_Value, 12, 2);
//						acceleration_actual_float.z_Value = ACC_convertAccelToFloat(acceleration_actual.z_Value, 12, 2);
						sensor_set[actualSet].acceleration = acceleration_actual;
					}
					// wenn Lesefehler dann blinken alle 3 mal
					else{
						for(int i=0;i<3;i++){
							HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_SET);
							HAL_Delay(200);
							HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_RESET);
							HAL_Delay(200);
						}
					}
				}
			}
			
			/* Einlesen der Positionsdaten und Ablage in den Datensatz -------------*/
			if(GNSS_ENABLE){
				if(getPosition | getDataset){
					getPosition = 0;
					getDataset--;
					// ...
					sensor_set[actualSet].timestamp = clock_time;
				}
			}
			
			actualSet++;
		}
		

		
		/* F�llen des Datensatzes und Abspeichern auf die SD-Karte ---------------*/
		if((actualSet == datasetCount) | writeDataset | (event == eject_card)){
			HAL_NVIC_DisableIRQ(TIM4_IRQn);
			if(SDIO_ENABLE){
				write_dataset_to_file(&logFile, logFileName, sensor_set, actualSet, &cursor);
			}
			writeDataset = 0;
			actualSet = 0;
			if(event == eject_card){
				HAL_GPIO_WritePin(LED4_GPIO_Port, LED4_Pin, GPIO_PIN_SET);
				event = no_event;
			}
			else{
				HAL_NVIC_EnableIRQ(TIM4_IRQn);
			}
		}
		
		//HAL_Delay(100);
  }
  /* USER CODE END 3 */

}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Configure the main internal regulator output voltage 
    */
  __HAL_RCC_PWR_CLK_ENABLE();

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* ADC1 init function */
static void MX_ADC1_Init(void)
{

