FahrJo/STM32F4_Transportkontrollsystem/Src/main.c
  /*Configure GPIO pins : LED4_Pin LED3_Pin LED5_Pin LED6_Pin 
                           Audio_RST_Pin */
  GPIO_InitStruct.Pin = LED4_Pin|LED3_Pin|LED5_Pin|LED6_Pin 
                          |Audio_RST_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pin : SDIO_detect_Pin */
  GPIO_InitStruct.Pin = SDIO_detect_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(SDIO_detect_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : VBUS_FS_Pin */
  GPIO_InitStruct.Pin = VBUS_FS_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(VBUS_FS_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : OTG_FS_ID_Pin OTG_FS_DM_Pin OTG_FS_DP_Pin */
  GPIO_InitStruct.Pin = OTG_FS_ID_Pin|OTG_FS_DM_Pin|OTG_FS_DP_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_FS;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pin : OTG_FS_OverCurrent_Pin */
  GPIO_InitStruct.Pin = OTG_FS_OverCurrent_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(OTG_FS_OverCurrent_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : Audio_SCL_Pin */
  GPIO_InitStruct.Pin = Audio_SCL_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF4_I2C1;
  HAL_GPIO_Init(Audio_SCL_GPIO_Port, &GPIO_InitStruct);

  /* EXTI interrupt init*/
  HAL_NVIC_SetPriority(EXTI0_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI0_IRQn);

  HAL_NVIC_SetPriority(EXTI2_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI2_IRQn);

  HAL_NVIC_SetPriority(EXTI3_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI3_IRQn);

  HAL_NVIC_SetPriority(EXTI4_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI4_IRQn);

}

/* USER CODE BEGIN 4 */
void Timer4_Init(void){
	RCC->APB1ENR |= (1<<2); 					// APB: Advanced Perifery Bridge
	TIM4->PSC = 4200-1;								// Prescaler f�r Timer 4
	TIM4->ARR = 20000-1;							// Autoreload Limit
	
	TIM4->DIER |= 0x1;								// Enable Timer 4 for set an Interrupt
	NVIC_EnableIRQ(TIM4_IRQn);				// Enable Interrupt f�r Timer 4
	TIM4->CR1 |= 0x1;									// Konfig-Register f�r Timer 4 / Channel 1
}

void AnalogWDG_Init(void){
	AnalogWDGConf.WatchdogMode = ADC_ANALOGWATCHDOG_ALL_REG;
	AnalogWDGConf.Channel = ADC_ALL_CHANNELS;
	AnalogWDGConf.HighThreshold = MAX_TEMP_RAW;
	AnalogWDGConf.LowThreshold = MIN_TEMP_RAW;
	AnalogWDGConf.ITMode = ENABLE;
	
	HAL_ADC_AnalogWDGConfig(&hadc1, &AnalogWDGConf);
}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin){
	operation_mode = workmode_log;
	if(GPIO_Pin == User_Button_Pin){
		event = eject_card;
	}
	else if(GPIO_Pin == INT_Photodiode_Pin){
		event = open_event;
	}
	else if(GPIO_Pin == INT_Acceleration_Pin){
		event = vibration_event;
	}
}

void TIM4_IRQHandler(){							// Interrupt Handler (ISR)
	TIM4->SR &=~ (0x1);
	if(operation_mode == workmode_log){
		//HAL_GPIO_TogglePin(LED5_GPIO_Port, LED5_Pin);
		clock_time.tm_sec++;
		getDataset = GET_DATA;
	}
}

void HAL_ADC_LevelOutOfWindowCallback(ADC_HandleTypeDef* hadc){
	operation_mode = workmode_log;
	event = temp_event;
	HAL_GPIO_WritePin(LED5_GPIO_Port, LED5_Pin, GPIO_PIN_SET);
}

void setPreferences(char* buff, UINT buffLength){
	/*
	char* token;
    char* prefBuff;
    char* trennzeichen = "= ;\n";
    char* pref[2][16];
    int   row = 0;
    prefBuff     = strstr(buff, "enableAcc");
    token         = strtok(prefBuff, trennzeichen);
    
    while(token != NULL && row < 16){
      pref[0][row] = token;
      token = strtok(NULL, trennzeichen);
      pref[1][row] = token;
      token = strtok(NULL, trennzeichen);
      printf("%i: pref: %s --> value: %s\n", row, pref[0][row], pref[1][row]);
      row++;
    }
	*/
		
		
		MAX_TEMP_RAW = MAX_TEMP * 4096 / 600;
	  MIN_TEMP_RAW = MIN_TEMP * 4096 / 600;
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
